In [ ]:
!pip install pandas

In [2]:
import pandas as pd 
import numpy as np

In [3]:
data = {"Name":["sachin",'lakshay','saurabh','abhishek'],
       "Branch":["cse",'it','ece','cse'],
       "college":['piet','jecrc','raffels','piet'],
       "roll_no":[10,20,30,50]}
data

{'Name': ['sachin', 'lakshay', 'saurabh', 'abhishek'],
 'Branch': ['cse', 'it', 'ece', 'cse'],
 'college': ['piet', 'jecrc', 'raffels', 'piet'],
 'roll_no': [10, 20, 30, 50]}

In [6]:
df = pd.DataFrame(data)
df 
# arr = np.array()  data structure

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [7]:
type(df)

pandas.core.frame.DataFrame

In [9]:
type(df['Name'])

pandas.core.series.Series

In [21]:
df['roll_no']  # single columns

0    10
1    20
2    30
3    50
Name: roll_no, dtype: int64

In [15]:
df.Name

0      sachin
1     lakshay
2     saurabh
3    abhishek
Name: Name, dtype: object

In [19]:
df[['Name','Branch','roll_no']]

       Name Branch  roll_no
0    sachin    cse       10
1   lakshay     it       20
2   saurabh    ece       30
3  abhishek    cse       50

In [18]:
df[['Branch',"Name"]]

  Branch      Name
0    cse    sachin
1     it   lakshay
2    ece   saurabh
3    cse  abhishek

In [22]:
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [23]:
### loc & iloc 
df.iloc[2:4,2:4]

   college  roll_no
2  raffels       30
3     piet       50

In [24]:
df.iloc[-2:,-2:]

   college  roll_no
2  raffels       30
3     piet       50

In [25]:
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [26]:
df.loc[2:4,['college','roll_no']]

   college  roll_no
2  raffels       30
3     piet       50

In [27]:
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [35]:
df.iloc[-2:-4:-1]

      Name Branch  college  roll_no
2  saurabh    ece  raffels       30
1  lakshay     it    jecrc       20

In [29]:
ls = [10,20,30,50,62,21,45,63,85]

ls

[10, 20, 30, 50, 62, 21, 45, 63, 85]

In [30]:
ls[2]

30

In [32]:
ls[3:6]

[50, 62, 21]

In [39]:
file_path = "C:\\Users\\Ranjit\\Desktop\\15 July\\Used_Bikes.csv"
df = pd.read_csv(file_path)

In [40]:
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj